{
    "id": 2,
    "name": "Storage Room",
    "aliases": ["wooden door"],
    "north": "", 
    "south": "", 
    "east": 3, 
    "west": "", 
    "up": "", 
    "down": "",
	"longDesc": "You are in a room full of large storage lockers. Most of the lockers are chained closed.  There is a paper hanging from a peg by the door. There is one locker that does not appear all the way shut and the chain on it is loose like someone closed it in a hurry. To the east there is a wooden door.",
    "shortDesc": "You are in a room full of storage lockers.  There is a paper hanging from a peg next to the door. One of the lockers is ajar. To the east there is a wooden door.",
    "feat1": "locker",
    "feat1desc": "One of a series of large metal storage lockers is ajar. They are all roughly the size of a small room. You peer through the crack in the door and there is an object on the floor just out of reach. Your eyes adjust to the darkness and you see that it's a handle of some kind.",
    "feat1interactOptions": "use board on, pry open, pry with board, swing, open with board",
    "feat1interactSuccess": "You use the board to pry the locker open just far enough to get the board and your hand in. You then reach in with the board and, after a few swings, manage to land the end just on the other side of the handle. A splinter digs into your palm fiercely. You slowly nudge the handle close enough to the locker door to be able to reach it.",
    "feat1interactComplete": "You peer inside the locker. It's the size of a small room and completely empty.",
    "feat1interactFail": "You get down and reach as far as you can into the locker. The loose chain pulls taught as you cram your arm into the small opening. Your cheek smushes against the cold door as you reeeeaccchhh..! It's no good. The handle is too far away.",
    "feat2": "paper",
    "feat2desc": "A thin piece of paper is stuck to a peg on the wall. It reads: Subject 11 - Locker A, Subject 45 - Locker B, Subject 15 - Locker C, and the last line appears to be scratched out. The paper is pretty thin. You wonder if there's another way to read what was scratched out.",
    "feat2interactOptions": "examine, turn over, check",
    "feat2interactSuccess": "A thin piece of paper is stuck to a peg on the wall. It reads: Subject 11 - Locker A, Subject 45 - Locker B, Subject 15 - Locker C, and the last line is scratched out. You know, however, that the last line reads: Subject 13 - Brig.",
    "feat2interactComplete": "It's such a thin piece of paper. You lightly turn it over and gaze at the back of the paper. Whoever scratched it out didn't press nearly as hard as the heavy handed person that originally wrote the list. It's backwards so it takes you a moment, but you finally make out: Subject 13 - Brig.",
    "feat2interactFail": "Whoever scratched out the paper used a pretty dark ink. You wonder if there's some other way to read it.",
    "feat3": "door",
    "feat3desc": "A pretty average looking wooden door.",
    "feat3interactOptions": "try, check, open",
    "feat3interactSuccess": "A pretty average looking unlocked wooden door.",
    "feat3interactComplete": "You try the wooden handle - it's unlocked!",
    "feat3interactFail": "Wooden Door Fail - this should never display",
    "feat4": "F4 - NA",
    "feat4desc": "F4 description",
    "feat4interactOptions": "F4 interaction options",
    "feat4interactSuccess": "F4 interaction success",
    "feat4interactComplete": "F4 interaction complete",
    "feat4interactFail": "F4 interaction fail",
    "feat5": "F5 - NA",
    "feat5desc": "F5 description",
    "feat5interactOptions": "F5 interaction options",
    "feat5interactSuccess": "F5 interaction success",
    "feat5interactComplete": "F5 interaction complete",
    "feat5interactFail": "F5 interaction fail",
    "feat6": "F6 - NA",
    "feat6desc": "F6 description",
    "feat6interactOptions": "F6 interaction options",
    "feat6interactSuccess": "F6 interaction success",
    "feat6interactComplete": "F6 interaction complete",
    "feat6interactFail": "F6 interaction fail"
}
