{
    "id": 15,
    "name": "Processing",
    "aliases": ["metal door"],
    "north": "", 
    "south": "", 
    "east": 11, 
    "west": "", 
    "up": "", 
    "down": "",
	"longDesc": "A sparsely decorated room.  A metal hatch is here on the South wall, but it appears to be locked.  There is a strange small hole next to the door, which might affect the hatch.  The metal door to the East leads back to the hallway.",
    "shortDesc": "This is a sparsely decorated room.  A metal hatch is here on the South wall, but it appears to be locked.  There is a small hole next to the door. There is a metal door back to the hallway to the East.",
    "feat1": "hatch",
    "feat1desc": "A rounded metal hatch.  There is some kind of locking mechanism on it.",
    "feat1interactOptions": "use, pull, open",
    "feat1interactSuccess": "With a loud creak, the hatch reluctantly opens up.  You see daylight outside.",
    "feat1interactComplete": "The hatch is open.  The outside air is right in front of you.",
    "feat1interactFail": "You are unable to open the hatch.  Perhaps you need to do something to unlock it?",
    "feat2": "small hole",
    "feat2desc": "The small hole leads to a long cylindrical tube. It's about the right size you could stick your arm into. It is too dark to see what is inside of it.",
    "feat2interactOptions": "put hand in, stick hand in, put arm in, stick arm in, insert hand, insert arm",
    "feat2interactSuccess": "You reluctantly stick your arm into the small hole.  You can feel a crank at the end of it.",
    "feat2interactComplete": "The small hole leads to a long cylindrical tube with a crank at the end.",
    "feat2interactFail": "You are unable to use the device.",
    "feat3": "crank",
    "feat3desc": "You can't see it, but you can feel the crank deep inside the tube.  It feels like it can be cranked out towards you.",
    "feat3interactOptions": "pull, use",
    "feat3interactSuccess": "You pull the crank out towards you.  It moves slowly at first, then suddenly there is a loud click and the crank stops.  You release the crank and retract your arm.  It appears to have locked a metal bracelet around your wrist. You hear the hiss of an airlock releasing coming from the metal hatch.",
    "feat3interactComplete": "You used the crank already.",
    "feat3interactFail": "You don't see a handle.",
    "feat4": "bracelet",
    "feat4desc": "A metal bracelet you seem to have acquired when you put your arm in the small hole and used the crank. Printed on the bracelet is 'Northern Medical Research Center, phone: (217) 335-1251.'",
    "feat4interactOptions": "pull on, remove, examine, take off",
    "feat4interactSuccess": "You try to remove the bracelet.  It won't come off.",
    "feat4interactComplete": "A metal bracelet that is printed with 'Northern Medical Research Center, phone: (217) 335-1251.' You are not able to remove it.",
    "feat4interactFail": "It doesn't work.  You can't get the bracelet off.",
    "feat5": "metal door",
    "feat5desc": "A metal door leading back to the hallway.",
    "feat5interactOptions": "examine, check, try, open",
    "feat5interactSuccess": "You try the handle on the metal door. It's unlocked!",
    "feat5interactComplete": "An unlocked metal door leading back to the hallway.",
    "feat5interactFail": "Rm 15 F5 - interact fail",
    "feat6": "F6 - NA",
    "feat6desc": "",
    "feat6interactOptions": "",
    "feat6interactSuccess": "",
    "feat6interactComplete": "",
    "feat6interactFail": ""
}
