{
    "id": 7,
    "name": "Armory",
    "aliases": "wooden door",
    "north": 8, 
    "south": 6, 
    "east": "", 
    "west": "", 
    "up": "", 
    "down": "",
	"longDesc": "You are in a room with a large locker taking up one side of the room. On the other side of the room is a gun cabinet with at least a dozen rifle gleaming darkly inside the case. Next to the gun cabinet is an ornate gun case hanging on the wall. There is a wooden door to the South and a metal door to the North.",
    "shortDesc": "You are in a room with a locker on one side of the room and a gun cabinet full of rifles and a gun case on the opposite wall. There is a wooden door to the South and a metal door to the North.",
    "feat1": "gun cabinet",
    "feat1desc": "A cabinet containing at least a dozen well oiled and gleaming rifles. The cabinet is relatively plain and made of wood.  The rifles are secured inside the cabinet by a set of metal rods that are fastened over the firearms.",
    "feat1interactOptions": "examine, try, check",
    "feat1interactSuccess": "You examine the gun cabinet a little closer and see that it does not appear to have any accessible way to remove the firearms. Whatever you're about to do next, you're doing it without one of these rifles.",
    "feat1interactComplete": "A secured cabinet containing at least a dozen well oiled and gleaming rifles. The cabinet is relatively plain and made of wood.  The rifles are secured inside the cabinet by a set of metal rods that are fastened over the firearms and you cannot see a way to remove them.",
    "feat1interactFail": "Gun Cabinet Fail - this should never display",
    "feat2": "wooden door",
	"feat2desc": "There is a plain looking wooden door to the South.",
    "feat2interactOptions": "open, enter, use, try",
    "feat2interactSuccess": "You pull lightly on the handle of the wooden door. It's unlocked!",
    "feat2interactComplete": "There is an unlocked plain wooden door to the South.",
    "feat2interactFail": "Wooden Door Fail - this should never display",
    "feat3": "locker",
    "feat3desc": "A large ceiling height locker is built into one side of the room. The faint smell of metal and gunpowder emanates from inside.",
    "feat3interactOptions": "examine, try, check",
    "feat3interactSuccess": "The locker is of sturdy construction.  You try the handle and the door is locked up tight. When you're standing closer to the locker the aroma of gunpowder becomes stronger.",
    "feat3interactComplete": "A large, secured ceiling height locker is built into one side of the room. The faint smell of metal and gunpowder emanates from inside and becomes stronger when you get closer to the locker.",
    "feat3interactFail": "Locker Fail - this should never display",
    "feat4": "gun case",
    "feat4desc": "An ornate gun case hanging from the wall. It is an exquisite piece made of finely carved wood with a glass front secured by a delicate lock. Inside is an ornate pistol with a pearl inlay handle. It almost glows in the soft light and is truely a finely crafted firearm.",
    "feat4interactOptions": "unlock, open",
    "feat4interactSuccess": "You gently unlock the case using the small key and open it. The pistol is resting on a bed of crushed crimson velvet.",
    "feat4interactComplete": "An ornate gun case hanging from the wall. It is an exquisite piece made of finely carved wood with a glass front. Inside is an empty crushed crimson velvet cushion.",
    "feat4interactFail": "You attempt to open the case.  It's locked up tight.",
    "feat5": "metal door",
    "feat5desc": "A rather ordinary metal door. Steel, perhaps?",
    "feat5interactOptions": "examine, check, try, open",
    "feat5interactSuccess": "You try the handle and it opens smoothly. The door is not locked and seems to have been oiled recently.",
    "feat5interactComplete": "An unlocked, though rather ordinary, metal door. It is in impeccable working order.",
    "feat5interactFail": "Metal Door Fail - this should never display",
    "feat6": "",
    "feat6desc": "",
    "feat6interactOptions": "",
    "feat6interactSuccess": "",
    "feat6interactComplete": "",
    "feat6interactFail": ""
}
