{
    "id": 11,
    "name": "Hallway",
    "aliases": "ladder, deck 3, glass door",
    "north": 12, 
    "south": "", 
    "east": "", 
    "west": 15, 
    "up": "", 
    "down": 10,
	"longDesc": "This is a short hallway.  There is a ladder heading back down to the lower decks, a solid metal door, and a clear glass door that seems to lead to some sort of garden.  On the opposite wall, there is a locked door and a painting of a dog.  A plant sits in the corner.",
    "shortDesc": "You are in a short hallway.  There is a ladder heading back down to the lower decks, a solid metal door, and a clear glass door that seems to lead to some sort of garden. There is a painting of a dog on the wall and a plant in the corner.",
    "feat1": "ladder",
    "feat1desc": "This ladder heads back down to the lower decks",
    "feat1interactOptions": "climb, descend, go, use",
    "feat1interactSuccess": "You climb down the ladder.",
    "feat1interactComplete": "You descend into the lower decks.",
    "feat1interactFail": "You are unable to climb.",
    "feat2": "metal door",
    "feat2desc": "This door seems to be made of solid metal.",
    "feat2interactOptions": "use, unlock, open, go",
    "feat2interactSuccess": "You carefully insert the keycard and pull it back out a moment later.  A light blinks green as the keycard is accepted, and the door opens.",
    "feat2interactComplete": "The door is unlocked.",
    "feat2interactFail": "The door is locked.  It looks like some sort of keycard is required to pass through this door.",
    "feat3": "glass door",
    "feat3desc": "This is a glass door that seems to lead into some sort of garden.",
    "feat3interactOptions": "open, push, go",
    "feat3interactSuccess": "You open the door into the garden.",
    "feat3interactComplete": "The door is open.",
    "feat3interactFail": "The door is locked, though it shouldn't be.",
    "feat4": "locked door",
    "feat4desc": "This door appears to be locked from the other side.",
    "feat4interactOptions": "use, open, pull, check, examine",
    "feat4interactSuccess": "You pull on the handle, it's definitely locked.",
    "feat4interactComplete": "This door is locked from the other side.",
    "feat4interactFail": "You are unable to open the door.  Perhaps it isn't meant to be opened.",
    "feat5": "painting",
    "feat5desc": "You glance at the painting of a dog wearing a pirate hat.  Maybe you should examine it more closely.",
    "feat5interactOptions": "study, examine, look closer, take a look at",
    "feat5interactSuccess": "You take a closer look at the painting.  It is a white terrier wearing a pirate hat.  The name 'Bucky' can be faintly read on the bowl.  He seems to have bacon in his bowl.  Lucky dog.",
    "feat5interactComplete": "A dog named Bucky wearing a pirate hat, in front of a bowl of bacon.  Lucky dog.",
    "feat5interactFail": "You are unable to look at the painting.",
    "feat6": "plant",
    "feat6desc": "You examine the plant.  You realize that it's actually plastic when you touch it, but it still looked amazingly lifelike at first glance.",
    "feat6interactOptions": "Rm 11 F6 - interact options",
    "feat6interactSuccess": "Rm 11 F6 - interact success",
    "feat6interactComplete": "Rm 11 F6 - interact complete",
    "feat6interactFail": "Rm 11 F6 - interact fail"
}
