{
    "id": 3,
    "name": "Lower Hallway",
    "aliases": ["hallway", "barred door", "entryway", "door", "first deck", "deck one", "lower deck", "bottom deck", "metal door", "deck one", "first deck", "lower deck", "bottom deck", "ladder"],
    "north": 5, 
    "south": 1, 
    "east": 4, 
    "west": 2, 
    "up": 6, 
    "down": "",
	"longDesc": "You are in a narrow hallway.  To the north there is an entryway to another room.  To the south there is a wooden barred door. To the east there is a metal door. To the west there is a wooden door. There is a metal ladder in the middle of the room that leads up to a trap door in the ceiling. You seem to be in a hub of some kind.",
    "shortDesc": "You are in a hallway. There is a barred door to the south, a metal door to the east, and a wooden door to the west. To the north there is an entryway to another room. There is a metal ladder in the middle of the room that leads up to a trap door in the ceiling.",
    "feat1": "entryway",
    "feat1desc": "An entryway to another room. You look through the entryway and can see a room with a table in the center with chains attached to it. There are markings on the side of the entryway.",
    "feat1interactOptions": "check, examine",
    "feat1interactSuccess": "You look closer at the markings on the entryway.  At first they looked like tally marks.  On second look, they appear to be more like claw marks... or perhaps from fingernails? *gulp*",
    "feat1interactComplete": "An entryway to another room. You look through the entryway and can see a room with a table in the center with chains attached to it. There are markings on the side of the entryway that look like they are from fingernails. They make you uncomfortable.",
    "feat1interactFail": "Entryway Fail - this should never display",
    "feat2": "barred door",
    "feat2desc": "There is a barred door to another room with a brass handle. It has a small window in it. You peer through the window and can see that it opens into a dungeon of some kind.",
    "feat2interactOptions": "try, open, check, examine",
    "feat2interactSuccess": "You try the brass handle - it's unlocked!",
    "feat2interactComplete": "There is a barred door to another room with a brass handle. It has a small window in it. You peer through the window and can see that it opens into a dungeon of some kind. It's unlocked.",
    "feat2interactFail": "Barred Door Fail - this should never display",
    "feat3": "metal door",
    "feat3desc": "There is a metal door with a sign on it that is neatly engraved with the words Observation Room. The door is missing a handle. It's like someone didn't want anyone to be able to get inside.",
    "feat3interactOptions": "try, open, check, examine, use handle on",
    "feat3interactSuccess": "You take the handle and, with a little jimmying, get it to attach to the metal door. You give it a pull to see if it will come back off. Nope, permanent!",
    "feat3interactComplete": "There is a metal door with a sign on it that is neatly engraved with the words Observation Room. The door is complete and in working order. Nicely handled!",
    "feat3interactFail": "Without a handle, it's impossible to operate the door. You try but it won't budge an inch.",
    "feat4": "wooden door",
    "feat4desc": "There is a wooden door.  It is pretty average looking.",
    "feat4interactOptions": "try, open, check, examine",
    "feat4interactSuccess": "You try the wooden handle - it's unlocked!",
    "feat4interactComplete": "An unlocked wooden door.",
    "feat4interactFail": "Wooden Door Fail - this should never display",
    "feat5": "ladder",
    "feat5desc": "A sturdy metal ladder.",
    "feat5interactOptions": "climb, check, examine",
    "feat5interactSuccess": "You climb up the ladder to the trap door in the ceiling. You hop back down onto the floor.",
    "feat5interactComplete": "You climb up the ladder to the trap door in the ceiling. You find it pretty easy to climb, it's a well designed ladder. You hop back down.",
    "feat5interactFail": "Ladder Fail - this should never display",
    "feat6": "trap door",
    "feat6desc": "A heavy trap door in the ceiling with a handle on it. There is an old fashioned looking lock on the door.",
    "feat6interactOptions": "open, unlock, use key on, lift",
    "feat6interactSuccess": "You put the skeleton key into the lock and turn it. There is a heavy click. You try the handle and, with much effort, it grinds open. You are able to lift the door.",
    "feat6interactComplete": "A heavy trap door in the ceiling with a handle on it. There is an old fashioned looking lock on the door. It's unlocked.",
    "feat6interactFail": "You try to lift the trap door. It looks heavy but shouldn't be something you can't open. You try pulling the handle and it doesn't budge - locked! The door has an old fashioned looking lock on it. Distressed, you climb back down the ladder."
}
