{
    "id": 12,
    "name": "Private Quarters",
    "north": "", 
    "south": "", 
    "east": "", 
    "west": 13, 
    "up": "", 
    "down": "",
	"longDesc": "This appears to be someone's private room.  There are all sorts of gardening tools mixed with papers.  A computer terminal sits here.  A diary is sitting on the desk.",
    "shortDesc": "Someone's private room.  There are gardening tools and paper, as well as a computer terminal.",
    "feat1": "door",
    "feat1desc": "This door leads back into the garden.",
    "feat1interactOptions": "You open the door.",
    "feat1interactSuccess": "The door to the garden is still open.",
    "feat1interactComplete": "The door to the garden is still open.",
    "feat1interactFail": "You are unable to open the door (error!)",
    "feat2": "computer",
    "feat2desc": "This looks like an older model of computer.",
    "feat2interactOptions": "type in Bucky, enter password Bucky",
    "feat2interactSuccess": "You enter the password into the terminal.  It brings you to a command line terminal with a few options.",
    "feat2interactComplete": "The terminal is unlocked.",
    "feat2interactFail": "It seems to be asking for some sort of password.",
    "feat3": "diary",
    "feat3desc": "It looks like someone was writing a diary addressed to someone else.",
    "feat3interactOptions": "read, investigate, examine, study, peek",
    "feat3interactSuccess": "The last entry reads: 'John, I wish I could head home soon.  I was supposed to go home next month, but I fell down a ladder while doing some work and need some time to recover.  Plus the insurance refused to pay the bill - apparently when I got caught in that brawl in the mess room before, they flagged me as having a 'pre-existing condition', whatever that means.  So stupid.  I'll have to extend my contract to pay off the bills.  Miss you.'",
    "feat3interactComplete": "You skim through the diary again.  The entries aren't dated, but it seems the author had been here for at least two years.  On the inside back cover, you notice some numbers scribbled faintly - 4 8 15 16 23 42.",
    "feat3interactFail": "You can't read the diary.",
    "feat4": "painting",
    "feat4desc": "There is a painting of a white terrier wearing a captain's hat here.",
    "feat4interactOptions": "examine, study",
    "feat4interactSuccess": "The dog is sitting in front of a dish of bacon.  It's faint, but you can make out 'Bucky' on the collar.  Lucky dog.",
    "feat4interactComplete": "The dog is sitting in front of a dish of bacon.  It's faint, but you can make out 'Bucky' on the collar.  Lucky dog.",
    "feat4interactFail": "You are unable to look at the painting.",
    "feat5": "desk drawer",
    "feat5desc": "A slightly ajar desk drawer.",
    "feat5interactOptions": "open",
    "feat5interactSuccess": "You open the drawer and rummage through the contents.",
    "feat5interactComplete": "You find.. stuff.",
    "feat5interactFail": "You are unable to open the drawer.",
    "feat6": "",
    "feat6desc": "",
    "feat6interactOptions": "",
    "feat6interactSuccess": "",
    "feat6interactComplete": "",
    "feat6interactFail": ""
}
