{
    "id": 6,
    "name": "Rum and Water",
    "north": 7, 
    "south": "", 
    "east": "", 
    "west": "", 
    "up": "", 
    "down": 3,
	"longDesc": "You are in a room full of barrels. They are stacked to the ceiling against every wall and give the room a claustrophobic feel. There is a faint scent of molasses in the air mixed with rust and damp wood.  The room is lit by a single oil lamp made from a bottle hanging from a rope off the ceiling. There is another bottle hanging from the ceiling, however it's not lit like the other one and hangs much lower.  There is a trap door in the floor and a wooden door to the North.",
    "shortDesc": "You are in a room full of barrels. The room is lit by a single oil lamp made from a bottle hanging from a rope off the ceiling. There is another bottle hanging from the ceiling, however it's not lit like the other one and hangs much lower.  There is a trap door in the floor and a door to the North.",
    "feat1": "bottle",
    "feat1desc": "There is a bottle hanging low from a rope on the ceiling. It looks like it might have been a companion lamp for the oil lamp burning brightly in the room but it's not lit. You look at it closer and see that there appears to be something in the murky liquid in the bottle.",
    "feat1interactOptions": "pour out, dump out, empty",
    "feat1interactSuccess": "You take the low hanging bottle and empty the contents out onto the floor. The molasses smell intensifies for a moment and then the familiar aroma of alchol is present. What was in this? Rum?",
    "feat1interactComplete": "You examine the now empty bottle and see that inside of it was a piece of paper. It's damply stuck up against the inside of the bottle. It takes a moment, but you're able to make out '.... ..r k.. behi.. ..rrel.' Pity, some of the text was washed out by the liquid in the bottle.",
    "feat1interactFail": "It sure still looks like there might be something in that bottle.  You wonder what would be the best way to be able to get it.",
    "feat2": "lamp",
    "feat2desc": "An oil lamp made from a bottle hangs from the ceiling by a rope.",
    "feat2interactOptions": "examine, check, search",
    "feat2interactSuccess": "You check the oil lamp more closely. It seems to contain some type of fuel with a cotton wick burning brightly out of the neck of the bottle. The bottle is a nice round shape and it seems like it might have previously contained some type of alchohol.",
    "feat2interactComplete": "A cheerfully burning oil lamp made out of a bottle that looks like it at one time contained some kind of alcohol.",
    "feat2interactFail": "Lamp Fail - this should never display",
    "feat3": "trap door",
    "feat3desc": "There is a heavy looking trap door in the floor.",
    "feat3interactOptions": "open, lift, enter, use, try",
    "feat3interactSuccess": "You lift on the handle of the trap door and it creaks open slowly. It's not locked and really heavy!",
    "feat3interactComplete": "There is an unlocked heavy trap door in the floor.",
    "feat3interactFail": "Trap Door Fail - this should never display",
    "feat4": "barrels",
    "feat4desc": "The room is stacked to the ceiling with barrels.  They are of a medium size and made of wood fastened together with bands of iron. ",
    "feat4interactOptions": "look behind, search, check, examine ",
    "feat4interactSuccess": "You begin searching around the barrels - on the floor, between them... nothing. You decide, with a little apprehension for sticking your hands into unknown dark corners, to search behind the barrels. You systematically search thoroughly behind each barrel.  About half way around the room your finger brushes against something. You nudge it out from behind the barrel to the floor where you can see it. It's a small key!",
    "feat4interactComplete": "You have searched these barrels more thoroughly than you would have liked to. They are of a medium size and made of wood fasterned together with bands of iron.",
    "feat4interactFail": "Barrels Fail - this should never display",
    "feat5": "wooden door",
    "feat5desc": "There is a plain looking wooden door to the North.",
    "feat5interactOptions": "open, enter, use, try",
    "feat5interactSuccess": "You pull lightly on the handle of the wooden door. It's unlocked!",
    "feat5interactComplete": "There is an unlocked plain wooden door to the North.",
    "feat5interactFail": "Wooden Door Fail - this should never display",
    "feat6": "",
    "feat6desc": "",
    "feat6interactOptions": "",
    "feat6interactSuccess": "",
    "feat6interactComplete": "",
    "feat6interactFail": ""
}
