{
    "id": 14,
    "name": "Side",
    "aliases": ["office", "east door", "side"],
    "north": "", 
    "south": "", 
    "east": "", 
    "west": 12, 
    "up": "", 
    "down": "",
    "longDesc": "This room smells stale with disuse.  A threadbare red rug covers the center of the floor.  A large wooden chest is sitting against the wall opposite the door.  There is a desk in the center, with what looks like a letter sitting on top of it. There is a framed photo on the desk. One of the desk drawers has not been fully closed and hangs ajar. The garden door is on the western wall, where you entered the room.",
    "shortDesc": "A side room with a large wooden chest is sitting against the wall opposite the door.  There is a desk in the center, with what looks like a letter sitting on top of it and a framed photo. One of the desk drawers has not been fully closed and hangs ajar. The garden door is on the western wall, which you entered from.",
    "feat1": "garden door",
    "feat1desc": "You check the door and recognize it.  It's the garden door.",
    "feat1interactOptions": "examine, check, try, open",
    "feat1interactSuccess": "You try the handle. The garden door is unlocked.",
    "feat1interactComplete": "The garden door is unlocked.",
    "feat1interactFail": "You are unable to open the door (error!)",
    "feat2": "photo",
    "feat2desc": "This is a picture of a boy wearing a hat.",
    "feat2interactOptions": "examine, study, check",
    "feat2interactSuccess": "You take a closer look at the photo.  A young boy with a fancy blue captain's hat on his head, making a silly face.  It's faint, but you can make out the name 'Tyler' on the hat.",
    "feat2interactComplete": "You re-examine the picture.  Cute kid wearing a captain's hat.  The name 'Tyler' can be seen faintly on the hat.",
    "feat2interactFail": "You don't see a photo.",
    "feat3": "drawer",
    "feat3desc": "A slightly ajar desk drawer.",
    "feat3interactOptions": "open, pull, examine, check, try",
    "feat3interactSuccess": "You open the drawer and rummage through the contents.  The only thing that catches your eye is a strange wooden device with wheels that can be turned to spell a word.  It was called.. a cryptex?",
    "feat3interactComplete": "The drawer is still open.  There was a strange wooden device inside.",
    "feat3interactFail": "You are unable to open the drawer.",
    "feat4": "fireplace",
    "feat4desc": "A small fireplace.  It looks like it can be started with a switch on the artificial logs.",
    "feat4interactOptions": "light, use, start, turn on",
    "feat4interactSuccess": "With a light click, the fireplace is lit.  Warm and cozy...",
    "feat4interactComplete": "The fireplace is already lit.",
    "feat4interactFail": "You are unable to light the fireplace.",
    "feat5": "letter",
    "feat5desc": "A letter lies on the table.",
    "feat5interactOptions": "read, examine, skim",
    "feat5interactSuccess": "You skim through the letter, which is undated.  It appears to be a letter addressed to someone.  'Dearest, I'm sorry I had to leave you at a time like this.  It was the only way to pay for our boy's medical bills.  I'm scared at being away from you both for so long, and I don't even know when I'll be able to go home.  But I'm much more terrified of losing him forever.  They say that they'll pay the bills in full and give him the best treatment they can, if I participate in this experiment.  I hope I'll see you again soon.  They'll send this letter for me while I'm doing this.  Much love to you both.'",
    "feat5interactComplete": "You reread the letter and notice a hastily written note on the back.  'The captain will set me free.'  What could that mean?",
    "feat5interactFail": "You are unable to read the letter.",
    "feat6": "chest",
    "feat6desc": "An old fashioned wooden chest.",
    "feat6interactOptions": "unlock with lockpick, pick with lockpick, jimmy the lock with lockpick",
    "feat6interactSuccess": "You unlock the chest with the lockpick.  Inside are some clothes, an empty wallet, and a photo of a boy wearing a hat.",
    "feat6interactComplete": "The chest is open.  Inside are some clothes, an empty wallet, and a photo of a boy wearing a hat.",
    "feat6interactFail": "You are unable to open the chest. If only you could pick the lock with something. Maybe if you had a paperclip or something you could straighten it out and use that."
}
