{
    "id": 9,
    "name": "Galley",
    "aliases": ["canvas flap", "wooden door"],
    "north": "", 
    "south": 8, 
    "east": "", 
    "west": "", 
    "up": "", 
    "down": "",
	"longDesc": "The heavy aroma of cooking grease fills the air.  It makes you feel a little sick to your stomach, but also whets your appetite a bit. You're not sure when you last ate.  The galley has a wood burning stove on one side of the room. On the other side of the room is a sink and a trash can. There is a canvas flap covered entrance to the South.",
    "shortDesc": "The heavy aroma of cooking grease fills the air.  You are in a galley with a wood burning stove on one side of the room. On the other side of the room is a sink and a trash can. There is a canvas flap covered entrance to the South.",
    "feat1": "canvas flap",
    "feat1desc": "A heavy canvas flap is nailed over the entrance to another room.",
    "feat1interactOptions": "examine, check, try, open",
    "feat1interactSuccess": "You run your hand over the canvas flap and it gives easily as there is nothing behind it. It is dingy and somewhat oily. This side of the flap has splatter marks on it. You're not sure what substance is splattered on it. Ick.",
    "feat1interactComplete": "A heavy canvas flap is nailed over the entrance to another room. There are unidentifiable splatter marks on it.",
    "feat1interactFail": "Canvas Flap Fail - this should never display",
    "feat2": "trash can",
    "feat2desc": "A trash can stands in the corner of the room.",
    "feat2interactOptions": "examine, check, search, rummage in",
    "feat2interactSuccess": "You peer into the lidless trash can. There is a variety of cooking scraps heaped inside and what appears to be some coffee grounds.",
    "feat2interactComplete": "A trash can stands in the corner of the room heaped with cooking scraps and what appears to be coffee grounds.",
    "feat2interactFail": "Trash Can Fail - this should never display",
    "feat3": "stove",
    "feat3desc": "A wood burning stove stands in the room across from the sink and trash can.",
    "feat3interactOptions": "examine, check, search",
    "feat3interactSuccess": "You hold your hand over the stove and it is only very slightly warm. You're not sure when this stove might have last been used.",
    "feat3interactComplete": "A slightly warm wood burning stove stands in the room across from the sink and trash can.",
    "feat3interactFail": "Stove Fail - this should never display",
    "feat4": "sink",
    "feat4desc": "A freestanding sink next to the trash can.",
    "feat4interactOptions": "examine, check, search",
    "feat4interactSuccess": "The sink is full of dirty dishes but no water. Crumbs and smears adorn the dishes. Looks like no one wanted to do this dirty job.",
    "feat4interactComplete": "A freestanding sink full of dirty dishes next to the trash can.",
    "feat4interactFail": "Sink Fail - this should never display",
    "feat5": "F5 - NA",
    "feat5desc": "",
    "feat5interactOptions": "",
    "feat5interactSuccess": "",
    "feat5interactComplete": "",
    "feat5interactFail": "",
    "feat6": "F6 - NA",
    "feat6desc": "",
    "feat6interactOptions": "",
    "feat6interactSuccess": "",
    "feat6interactComplete": "",
    "feat6interactFail": ""
}
