{
    "id": 13,
    "name": "Control",
    "aliases": ["blue door", "dimly lit room"],
    "north": "", 
    "south": "", 
    "east": 12, 
    "west": "", 
    "up": "", 
    "down": "",
	"longDesc": "This is a dimly lit room with a chair in front of some monitors.  A dog screensaver is currently displayed on the monitor. It bears a remarkable similarity to another dog you've seen recently.  There is a glass case on the desk.  Some notes are on a table by the chair; the labels 'group A', 'group B', and 'group C' are on each file. The blue door is on the eastern wall, where you entered from the garden.",
    "shortDesc": "This is a dimly lit room with a chair in front of some monitors.  A dog screensaver is currently displayed on the monitor.  There is a glass case on the desk. There are some notes labeled 'group A,' 'group B,' and 'group C.' The blue door is on the eastern wall, where you entered from the garden.",
    "feat1": "chair",
    "feat1desc": "A plain old chair.  Doesn't particularly look all that comfortable, either.",
    "feat1interactOptions": "sit, rest, use",
    "feat1interactSuccess": "You sit on the chair. It's pretty comfortable.",
    "feat1interactComplete": "A plain old chair.  It actually is pretty comfortable despite how it looks.",
    "feat1interactFail": "There is no need to sit down.",
    "feat2": "glass case",
    "feat2desc": "This is a glass case with a keycard under it.",
    "feat2interactOptions": "use board on",
    "feat2interactSuccess": "You hit the glass case repeatedly with the board.  It hurts, but you eventually break open the glass case, exposing the keycard.",
    "feat2interactComplete": "The case has been broken open.",
    "feat2interactFail": "You are unable to break the glass. If only you had something heavy to hit it with.",
    "feat3": "garden door",
    "feat3desc": "A plain metal garden door.  You came in through here from the garden.",
    "feat3interactOptions": "examine, check, try, open",
    "feat3interactSuccess": "Nothing special about this garden door.",
    "feat3interactComplete": "This door leads back to the garden.",
    "feat3interactFail": "",
    "feat4": "group a notes",
    "feat4desc": "These notes seem to be about a group of subjects called group A.",
    "feat4interactOptions": "read, investigate, study",
    "feat4interactSuccess": "You glance through the summary of the last page.  Alpha group did not respond at all to the treatment, but after exponentially increasing the dosage, the subjects became far more passive and tractable.  However, they seemed unable to retain new memories and were prone to heightened anxiety and seizures.  Subjects seemed to develop a cognative dissonance, nearing apathy, where information concerning their own situation was concerned.  It seems that these subjects are functional but seem no longer seem to be aware, or do not care, that they are participating in an experiment, even when told so.",
    "feat4interactComplete": "You look through the notes but there doesn't seem to be anything new.  Wonder what happened to these subjects...",
    "feat4interactFail": "You are unable to read through the notes on test group A.",
    "feat5": "group b notes",
    "feat5desc": "These notes seem to be about a group of subjects called group B.",
    "feat5interactOptions": "read, investigate, study",
    "feat5interactSuccess": "You glance through the notes.  After the failure of the alpha group, subject group beta was administered a similar amount of medication along with benzodiazepines and analgesics, among other compounds.  The resulting treatment proved effective in creating mostly tractable subjects but their recollection was severely impacted, as well as inexplicably causing severe incontinence and diarrhea.  Moderating the mixture may be necessary to reduce adverse side effects.  This mixture has shown to be useful as the information gained during the test seems to be lost as the treatment wears off, allowing for re-use of the subjects after a period of detoxification and restoration to baseline physical health levels.",
    "feat5interactComplete": "You look through the notes but there doesn't seem to be anything new.  Sounds like these subjects had it rough.",
    "feat5interactFail": "You are unable to read through the notes on test group B.",
    "feat6": "group c notes",
    "feat6desc": "These notes seem to be about a group of subjects called group C.",
    "feat6interactOptions": "read, investigate, study",
    "feat6interactSuccess": "You glance through the notes.  Adjustments were made from the results of beta group and we have determined that this is a near-optimal composition.  Individualized tests have become necessary in order to study the efficacy of different quantities of each component.  It is our belief that by putting the subject in an optimal situation to follow through with a suggestion, then they will carry through and allow us to observe their actions in a much more natural setting.  We can then increase the amount of direct intervention and observe the subjects' reactions to suggestions, as well as the effects of morality upon their thought processes.  The treatment seems to wear off after about two weeks, allowing us to retrieve the given subject and run the experiment again, with the subject having little or no memory of the prior experiment or their actions.",
    "feat6interactComplete": "You look through the notes but there doesn't seem to be anything new.  Wonder why they have all these notes on test subjects anways...",
    "feat6interactFail": "You are unable to read through the notes on test group C."
}
