{
    "id": 13,
    "name": "Garden",
    "north": "", 
    "south": 11, 
    "east": 12, 
    "west": 14, 
    "up": "", 
    "down": "",
	"longDesc": "This seems to be a mid-sized garden.  Artificial lights shine from above, along with skylights which appear to be shuttered.  You don't recognize all of the plants here.",
    "shortDesc": "",
    "feat1": "plants",
    "feat1desc": "Rows of lovely potted plants have been carefully planted and arranged.  It's clear that someone has put a lot of work into maintaining this garden.",
    "feat1interactOptions": "kick, hit, tip over, destroy, wreck, push",
    "feat1interactSuccess": "The pots fall over, crashing into one another like dominoes, then fall to the ground.  The pots shatter into countless pieces.  Dirt is scattered all over the floor.  You monster.",
    "feat1interactComplete": "Dirt, pieces of pottery and plants lie scattered on the floor, forgotten and abused.  If you listen carefully, you can hear the plants crying out for help.",
    "feat1interactFail": "You are unable to destroy the plants.",
    "feat2": "switch",
    "feat2desc": "This switch seems to control the overhead sprinkler system.  Probably it will water all the plants if flipped.",
    "feat2interactOptions": "flip, use, turn on, activate, toggle",
    "feat2interactSuccess": "You flip the switch.  Water sprays out all over, spraying water all over the room.  You needed that bath anyways...",
    "feat2interactComplete": "The sprinkler has already been activated.  It will take time to refill the tanks again.",
    "feat2interactFail": "You flip the switch, but nothing happens.",
    "feat3": "numbers",
    "feat3desc": "Some numbers have been carefully inscribed on the underside of the pot.  Maybe you should examine them further, they might be important.",
    "feat3interactOptions": "examine, look at, study, investigate, remember, memorize, take a look, see, view, get",
    "feat3interactSuccess": "The numbers read: 4 8 15 16 23 42.  Somehow you get an ominous feeling when you read them, but it passes.",
    "feat3interactComplete": "The numbers read: 4 8 15 16 23 42.  Why these numbers, you don't know, but maybe it'll come in useful.",
    "feat3interactFail": "You don't see any numbers.",
    "feat4": "door",
    "feat4desc": "This door is locked.  It looks like some small office or room.  You peer into the windows, and it looks like no one is inside.",
    "feat4interactOptions": "open, unlocked, go",
    "feat4interactSuccess": "The door is unlocked.",
    "feat4interactComplete": "The door is already unlocked.",
    "feat4interactFail": "The door is locked.  Maybe if you had some keys to try, you could open it.",
    "feat5": "",
    "feat5desc": "",
    "feat5interactOptions": "",
    "feat5interactSuccess": "",
    "feat5interactComplete": "",
    "feat5interactFail": "",
    "feat6": "",
    "feat6desc": "",
    "feat6interactOptions": "",
    "feat6interactSuccess": "",
    "feat6interactComplete": "",
    "feat6interactFail": ""
}
