{
    "id": 4,
    "name": "Observation Room",
    "north": "null", 
    "south": "null", 
    "east": "null", 
    "west": "3", 
    "up": "null", 
    "down": "null",
	"longDesc": "You are in a well lit room with neat rows of bottles stacked on a large shelf. Papers are neatly stacked on a large desk that sits just below a barred window. There is another window across from the barred window. There is a chest tucked in a corner with a shiny lock on it. There is a metal door to the East.",
    "shortDesc": "You are in a room with neat rows of bottles stacked on a large shelf. Papers are neatly stacked on a large desk that sits just below a barred window. There is another window in the room opposite the barred window. There is a chest with a shiny lock on it. There is a door to the East.",
    "feat1": "door",
    "feat1desc": "A metal door.",
    "feat1interactOptions": "go, open",
    "feat1interactSuccess": "You try the handle - it's unlocked!",
    "feat1interactComplete": "An unlocked metal door.",
    "feat1interactFail": "Metal door fail - this should never display",
    "feat2": "barred window",
    "feat2desc": "A barred window that looks into another room.",
    "feat2interactOptions": "examine, check",
    "feat2interactSuccess": "You look through the barred window and see a room with straw on the floor and a broken bench in the corner.",
    "feat2interactComplete": "A barred window that looks into a room with straw on the floor and a broken bench in the corner.",
    "feat2interactFail": "Barred window fail - this should never display",
    "feat3": "window",
    "feat3desc": "An odd window made of a single pane of glass. It reflects oddly in the light.",
    "feat3interactOptions": "examine",
    "feat3interactSuccess": "You step up to the window and gaze through it. It reflects the light in the room a little strangely. You are looking into another room with a table suspended from the ceiling from chains.",
    "feat3interactComplete": "A window that looks into a room with a table suspended from the ceiling by chains.",
    "feat3interactFail": "Window fail - this should never display",
    "feat4": "chest",
    "feat4desc": "A plain looking wooden chest with a shiny lock on it.",
    "feat4interactOptions": "unlock, use, search",
    "feat4interactSuccess": "You take out the keys you found and select the shiny key. It fits into the lock and you open the chest. It contains a collection of neatly folded white linens. You rummage through and near the bottom you hand hits something hard. You fish it out and place the object on the pile of linens. To your glee it's a skeleton key! Now THIS should come in handy, hehe!",
    "feat4interactComplete": "An unlocked chest full of badly rumpled linens.",
    "feat4interactFail": "You try the shiny lock, however it's, well, locked.",
    "feat5": "bottles",
    "feat5desc": "A shelf lined with neat rows of tinted bottles.",
    "feat5interactOptions": "examine",
    "feat5interactSuccess": "You try to pick one up and your hand bumps into what could possibly be the clearest glass you've ever seen. The entire shelf is encased. Undeterred, you peruse the shelf and see a label on one of the bottles. It reads: burundanga.",
    "feat5interactComplete": "A shelf encased in glass with neat rows of tinted bottles.  One of them contains burundanga.",
    "feat5interactFail": "Bottles fail - this should never display",
    "feat6": "papers",
    "feat6desc": "A neat stack of papers on the desk. The first page appears to be of some type of report.",
    "feat6interactOptions": "read, examine",
    "feat6interactSuccess": "You look over the cover page of the report. It's in a language you don't recognize. Under the title, a small penciled in footnote reads: Burundanga, Myth or Mind Control Drug? Shuddering, you can't remember how you got here in the first place. Reading that makes the hair on the back of your neck stand up.",
    "feat6interactComplete": "A report on a drug called burundanga. It's in a language you don't recognize.",
    "feat6interactFail": "Papers Fail - this should never display"
}
