{
    "id": 1,
    "name": "Brig",
    "aliases": "barred door, start,",
    "north": 1, 
    "south": "", 
    "east": "", 
    "west": "", 
    "up": "", 
    "down": "",
	"longDesc": "You are in a cold, damp room. The only source of light is coming through a barred window. There is straw on the floor and a low wooden bench in the corner. The only exit is a barred door to the North.",
    "shortDesc": "You are in a room that has straw on the floor and a bench in the corner. Light is coming through a barred window and there is a barred door to the North.",
    "feat1": "straw",
    "feat1desc": "There is thick layer of straw on the floor. It smells musty.",
    "feat1interactOptions": "search, move, lift, shift",
    "feat1interactSuccess": "You shift the straw around throughout the room. It's slimy underneath but there's nothing else there.",
    "feat1interactComplete": "There is a thick layer of straw on the floor. You searched it but found nothing.",
    "feat1interactFail": "Straw Fail - this should never display",
    "feat2": "bench",
    "feat2desc": "There is a rickety wooden bench in the corner. One of the boards looks loose.",
    "feat2interactOptions": "move, lift, pull on board, pull the board, pull on loose board",
    "feat2interactSuccess": "You grab the board and pull on it hard. It starts to crack. You keep pulling and a jagged piece of board comes off the bench. You gingerly drop the board on the bench and regret the splinters - ouch!",
    "feat2interactComplete": "There is a wooden bench in the corner with one of the boards missing.",
    "feat2interactFail": "Bench Fail - this should never display",
    "feat3": "window",
    "feat3desc": "There is a barred window to another room.  You peer through the window and see that the other room is well lit with neat rows of bottles stacked on a large shelf.  Papers are neatly stacked on a large desk that sits just below the window.  There is also a set of keys on the desk! You try to reach it and find that the keys are just out of reach.",
    "feat3interactOptions": "use board on, reach through, reach in, lift keys",
    "feat3interactSuccess": "You have a great idea! You take your splintered board, slip it through the barred window, and reach for the keys. After several attempts, a large splinter off the board catches the key ring and you are able to gingerly lift the keys high enough to place them on the sill where you can reach them. Success!",
    "feat3interactComplete": "There is a barred window with a neatly organized room on the other side.",
    "feat3interactFail": "You stand on your tippy toes and reeeeaccchhh..! But you just can't reach those keys.",
    "feat4": "door",
    "feat4desc": "There is a barred door to another room. It has a small window in it. You peer through the window and can see just beneath it there is a large brass handle with an ever larger brass lock. It looks like it opens into a hallway. You reach through the window and try the door. It's locked.",
    "feat4interactOptions": "open, push, try, check",
    "feat4interactSuccess": "You take the keys and select the brass key.  The lock is brass, after all. You reach through the window and put the key in the lock and turn it. You hear a satisfying click! You try the handle and voila! The door is unlocked.",
    "feat4interactComplete": "There is a barred door to a hallway. This door is unlocked, thanks to all your hard work!",
    "feat4interactFail": "You reach through the window and try the door. It's locked.",
    "feat5": "F5 - NA",
    "feat5desc": "F5 description",
    "feat5interactOptions": "F5 interaction options",
    "feat5interactSuccess": "F5 interaction success",
    "feat5interactComplete": "F5 interaction complete",
    "feat5interactFail": "F5 interaction fail",
    "feat6": "F6 - NA",
    "feat6desc": "F6 description",
    "feat6interactOptions": "F6 interaction options",
    "feat6interactSuccess": "F6 interaction success",
    "feat6interactComplete": "F6 interaction complete",
    "feat6interactFail": "F6 interaction fail"
}
