{
    "id": 15,
    "name": "Processing",
    "aliases": ["metal door"],
    "north": "", 
    "south": "", 
    "east": 11, 
    "west": "", 
    "up": "", 
    "down": "",
	"longDesc": "A sparsely decorated room.  A metal hatch is here on the South wall, but it appears to be locked.  There is a strange tubular device next to the door, which might affect the hatch.  The metal door to the East leads back to the hallway.",
    "shortDesc": "This is a sparsely decorated room.  A metal hatch is here on the South wall, but it appears to be locked.  There is a device next to the door. There is a door back to the hallway to the East.",
    "feat1": "hatch",
    "feat1desc": "A rounded metal hatch.  It seems to be connected to the device next to it.",
    "feat1interactOptions": "use, pull, open",
    "feat1interactSuccess": "With a loud creak, the hatch reluctantly opens up.  You see daylight outside.",
    "feat1interactComplete": "The hatch is open.  The outside air is right in front of you.",
    "feat1interactFail": "You are unable to open the hatch.  Perhaps the device will unlock it?",
    "feat2": "device",
    "feat2desc": "This device is a long cylindrical tube.  It is too dark to see what is inside of it, but you could probably reach inside.",
    "feat2interactOptions": "put hand in, stick hand in, put arm in, stick arm in, insert hand, insert arm",
    "feat2interactSuccess": "You reluctantly stick your arm into the device.  You can feel a handle at the end of it.",
    "feat2interactComplete": "You already used the device.",
    "feat2interactFail": "You are unable to use the device.",
    "feat3": "handle",
    "feat3desc": "You can't see it, but you can feel the handle deep inside the tube.  It feels like it can be pulled out towards you.",
    "feat3interactOptions": "pull",
    "feat3interactSuccess": "You pull the handle out towards you.  It moves slowly at first, then suddenly there is a loud click and the handle stops.  You release the handle and retract your arm.  It appears to have locked a metal bracelet around your wrist.",
    "feat3interactComplete": "",
    "feat3interactFail": "You don't see a handle.",
    "feat4": "bracelet",
    "feat4desc": "A metal bracelet you seem to have acquired when trying to use the device.  It looks like you can rotate the numbers on it like a combination lock, but it seems to have ten digits.  Printed on the bracelet is 'Northern Medical Research Center, phone: (217) 335-1251'",
    "feat4interactOptions": "enter 4815162342, use combination 4815162342",
    "feat4interactSuccess": "You enter the code into the bracelet.  You pull at it none-too-gently and it falls off your wrist.",
    "feat4interactComplete": "The bracelet lies on the floor.  Good riddance.",
    "feat4interactFail": "It doesn't work.  You can't get the bracelet off.",
    "feat5": "door",
    "feat5desc": "A metal door leading back to the hallway.",
    "feat5interactOptions": "Rm 15 F5 - interact options",
    "feat5interactSuccess": "Rm 15 F5 - interact success",
    "feat5interactComplete": "Rm 15 F5 - interact complete",
    "feat5interactFail": "Rm 15 F5 - interact fail",
    "feat6": "",
    "feat6desc": "",
    "feat6interactOptions": "",
    "feat6interactSuccess": "",
    "feat6interactComplete": "",
    "feat6interactFail": ""
}
