{
    "id": 15,    
	"name": "Control Room",
    "north": "", 
    "south": 16, 
    "east": 11, 
    "west": "", 
    "up": "", 
    "down": "",
	"longDesc": "A hum echoes through this room, which consists of a walkway leading to a circular device on the floor.  Below you, there are lights and wires crisscrossing through a lower level of the room, and you realize there are electronics permeating the ship.",
    "shortDesc": "You are in some sort of massive computer room.  A circular device is on the floor of a walkway in the center of the room.  Below you, you can see a electronics running throughout the room, and likely the entire ship.",
    "feat1": "device",
    "feat1desc": "This device has a lit orange button on it.",
    "feat1interactOptions": "use, push, look at",
    "feat1interactSuccess": "You push the button.",
    "feat1interactComplete": "It seems to turn on the device, which creates a hovering projection in front of you.",
    "feat1interactFail": "The device does not respond.  It appears to be broken.",
    "feat2": "floor",
    "feat2desc": "The floor below you is visible through a metal grate.  It looks like rows of computers and wires that go down and throughout the ship.",
    "feat2interactOptions": "look at",
    "feat2interactSuccess": "You can look at the floor.",
    "feat2interactComplete": "You examine the floor closely.  There are rows of active/inactive electronics.",
    "feat2interactFail": "",
    "feat3": "door",
    "feat3desc": "This is a metal door, which leads back to the hallway.",
    "feat3interactOptions": "use, go, look at",
    "feat3interactSuccess": "You use the door.",
    "feat3interactComplete": "You go back out to the hallway.",
    "feat3interactFail": "The door appears to be locked.",
    "feat4": "sealed door",
    "feat4desc": "This thick metal door is locked with deadbolts.  It seems that only the computer could release it.",
    "feat4interactOptions": "use, open, go, unlock, pull",
    "feat4interactSuccess": "There is a loud screech as the door is unlocked.  It seems that it has not been unlocked in a while.",
    "feat4interactComplete": "The door is unlocked.",
    "feat4interactFail": "You pull at the door handle and try to wiggle it open, but it is no use.  The lock seems to be controlled electronically.",
    "feat5": "",
    "feat5desc": "",
    "feat5interactOptions": "",
    "feat5interactSuccess": "",
    "feat5interactComplete": "",
    "feat5interactFail": "",
    "feat6": "",
    "feat6desc": "",
    "feat6interactOptions": "",
    "feat6interactSuccess": "",
    "feat6interactComplete": "",
    "feat6interactFail": ""
}
