{
    "id": 12,
    "name": "Garden",
    "aliases": ["glass door", "garden door", "out"],
    "north": "", 
    "south": 11, 
    "east": 14, 
    "west": 13, 
    "up": "", 
    "down": "",
	"longDesc": "The garden has many small plants in pots neatly arranged into rows.  You don't recognize all of the plants here.  There are two doors, one on the east and one on the west.  There is a switch on the wall near you, and a note on the floor haphazardly tossed on the ground.  One single flowering plant is in a corner.",
    "shortDesc": "There are many small plants in rows that you don't recognize.  One plant stands alone in the corner.  There is a switch on the wall near you, and a note on the floor.  There are doors on the east and west sides of the room.",
    "feat1": "plants",
    "feat1desc": "Rows of lovely potted plants have been carefully planted and arranged.  It's clear that someone has put a lot of work into maintaining this garden.",
    "feat1interactOptions": "kick, hit, tip over, destroy, wreck, push, move, push",
    "feat1interactSuccess": "The pots fall over, crashing onto the floor.  The pots shatter into countless pieces.  Dirt is scattered all over the floor.  You monster.  On the upside, you find a paper clip in the debris.  I hope it was worth it.",
    "feat1interactComplete": "Dirt, pieces of pottery and plants lie scattered on the floor, forgotten and abused.  If you listen carefully, you can hear the plants crying out for help.  You had found a paper clip in the ruins.",
    "feat1interactFail": "You are unable to destroy the plants.",
    "feat2": "switch",
    "feat2desc": "This switch seems to control the overhead sprinkler system.  Probably it will water all the plants if flipped.",
    "feat2interactOptions": "flip, use, turn on, activate, toggle",
    "feat2interactSuccess": "You flip the switch.  Water sprays out all over, spraying water all over the room.  Dripping wet, you look down at the floor, which was dirty but being rinsed clean by the water.  Someone scrawled 'push the button' on the floor in marker.  Wonder what that means...",
    "feat2interactComplete": "The sprinkler has already been activated.  It will take time to refill the tanks again.  The floor still reads 'push the button'.",
    "feat2interactFail": "You flip the switch, but nothing happens.",
    "feat3": "note",
    "feat3desc": "A hastily scribbled note that someone dropped on the floor.",
    "feat3interactOptions": "examine, study, investigate, see, view, get, read",
    "feat3interactSuccess": "The note reads: 'key in pot'.  Whatever could that mean?",
    "feat3interactComplete": "The note reads: 'key in pot'.  Whatever could that mean?",
    "feat3interactFail": "You don't see a note.",
    "feat4": "east door",
    "feat4desc": "This door is locked.  It looks like some small office or room.  You peer into the windows. There is no one inside.",
    "feat4interactOptions": "examine, check, try, open",
    "feat4interactSuccess": "The door is unlocked.",
    "feat4interactComplete": "The door is unlocked. This door leads to some kind of small office.",
    "feat4interactFail": "The door is locked.  Maybe if you had some keys to try, you could open it.",
    "feat5": "west door",
    "feat5desc": "You peer through a small window on the door.  It seems to lead to some dimly lit room with monitors and a single chair.",
    "feat5interactOptions": "examine, check, try, open",
    "feat5interactSuccess": "You try the door to the dimly lit room. It's unlocked!",
    "feat5interactComplete": "The door to the dimly lit room is unlocked.",
    "feat5interactFail": "You can't enter the room.  Error!",
    "feat6": "plant",
    "feat6desc": "One of the few plants with a label on it.  It has large, spearlike leaves and drooping golden flowers.",
    "feat6interactOptions": "examine, touch, study, check",
    "feat6interactSuccess": "You take a closer look at the plant.  The label says 'Brugmancia plant' along with 'Angel Trumpet' written underneath it.",
    "feat6interactComplete": "A specimen of the lovely 'Brugmancia plant' also known as an 'Angel Trumpet'.",
    "feat6interactFail": "You are unable to look at the plant."
}
