{
    "id": 8,
    "name": "Garrison",
    "aliases": ["metal door", "canvas", "canvas flap", "plain door"],
    "north": 9, 
    "south": 7, 
    "east": 10, 
    "west": "", 
    "up": "", 
    "down": "",
	"longDesc": "You are in a room with rows of bunk beds neatly lined up against one wall. The beds are all crisply made, complete with hospital corners! There is a plain table in one corner and a black and white photograph hanging on the wall. There is a metal door to the South, a plain door to the East, and a canvas flap covering an entrance to another room to the North.",
    "shortDesc": "You are in a room with rows of bunk beds neatly lined up against one wall. There is a table in one corner and a photograph hanging on the wall. There is a metal door to the South, a plain door to the East, and a canvas flap covering an entrance to another room to the North.",
    "feat1": "bunks",
    "feat1desc": "Crisply made bunk beds, complete with hospital corners! Someone either took a lot of time making these beds or was in the armed forces at one time.",
    "feat1interactOptions": "search, examine, check, toss",
    "feat1interactSuccess": "You hesitate for just a moment before tossing the bunk beds. You thoroughly check under the mattresses, around the edges, and inside the linens. Your search comes up empty.",
    "feat1interactComplete": "Disheveled bunk beds. You hope you never meet the person whose hard work you rumpled.",
    "feat1interactFail": "Bunks Fail - this should never display",
    "feat2": "table",
    "feat2desc": "A plain wooden table with a partially played game of cards laid out on it. Looks like the game of choice was poker.",
    "feat2interactOptions": "examine, check",
    "feat2interactSuccess": "You look over the table with the card game. It looks like there were four players and none of them had hands that were much good for poker.",
    "feat2interactComplete": "A plain wooden table with a partially played game of cards laid out on it. Looks like the game of choice was poker and none of the four players were any good at it.",
    "feat2interactFail": "Table Fail - this should never display",
    "feat3": "photograph",
    "feat3desc": "A black and white photograph is hanging up on the wall. It shows a group of people standing in front of a building.",
    "feat3interactOptions": "examine, check",
    "feat3interactSuccess": "The black and white photograph shows eight people standing in front of a building. Your gaze drifts from face to face and you're startled to see that YOU are standing in that group with an easy smile on your face! Your heart pounds as you try to recall this memory and you draw a blank. You look more closely at the building. The sign on the front is cut off, but the last few letters are ARCH CENTER. You have no memory of ever going to a place called the Arch Center.",
    "feat3interactComplete": "A black and white photograph featuring YOU and seven other people standing in front of the Arch Center, a place you don't ever remember being.",
    "feat3interactFail": "Photograph Fail - this should never display",
    "feat4": "plain door",
    "feat4desc": "A plain wooden door.  It's plainness has a center charm to it.",
    "feat4interactOptions": "open, check, examine, try",
    "feat4interactSuccess": "You try the handle on the somewhat charmingly plain wooden door. It's unlocked!",
    "feat4interactComplete": "An unlocked plain wooden door.  It's plainness has a certain charm to it.",
    "feat4interactFail": "Wooden Door Fail - this should never display",
    "feat5": "canvas flap",
    "feat5desc": "A heavy canvas flap is nailed over the entrance to another room.",
    "feat5interactOptions": "examine, check, try, open",
    "feat5interactSuccess": "You run your hand over the canvas flap and it gives easily as there is nothing behind it. It is dingy and somewhat oily. The movement of the flap allows the aroma of cooking grease to waft into the room.",
    "feat5interactComplete": "A heavy canvas flap is nailed over the entrance to another room. When moved it allows the aroma of cooking grease to waft through.",
    "feat5interactFail": "Canvas Flap Fail - this should never display",
    "feat6": "metal door",
    "feat6desc": "A metal door with something scratched into it.",
    "feat6interactOptions": "examine, check, try, open",
    "feat6interactSuccess": "You try the handle of the metal door and it's unlocked! You look more closely at the scratched area and see that it's graffiti that says IVAN WAS HERE. Some things never get old.",
    "feat6interactComplete": "A metal door with graffiti on it that reads IVAN WAS HERE.",
    "feat6interactFail": "Metal Door Fail - this should never display"
}
